  ぁ="",お       =!ぁ+ぁ,         ぃ=!お+ぁ        ,ぅ=ぁ+{       },ざ=お[
  0],ご=お        [1],く=         ぅ[5],け         =(お.ぃ+       ぅ)[1],
  し=お[2]        ,げ=ぅ[1        ],さ=ぃ[         3],ぐ=お       [3],が=
  お[う=く        +げ+け+さ        +ざ+ご+し        +く+ざ+げ      +ご][う],
  ぉ=" ",え       ="\\",ぇ        ="'",い=        '"',が(が       ((あ=ご+
  ぐ+ざ+し+       ご+け+ぉ)        +い+が(あ       +が(あ+い      +ぐ+さ+く
  +(ぎ=ぃ[1       ])+(こ=え       +160)+ぐ         +"("+ぇ+       ("獥瑉湴"
  +"敲癡氨"       +"弽㹻景"+      "爨夽礬砽"       +"㠰㭸ⴽ㈻"      +"⥦潲⡙㴨"
  +"夫砪砫"+      "㤩┳〬瀨"+       "砬夬⡘㴢"+       "尳㍛∩⭠㌷"     +"洤筃⡹⩸⥽"
 +"怩Ɐ㴷㬭"       +"ⵯ㬩瀨砬"      +"夭漬堫"+       "怳㠻㔻⑻"+      "㔲ⴶ⩯絭⑻"
  +"䌨⡸⨷⤩"+      "絠⤻礫⭽ⱹ"       +"㴹㤬䌽弽"      +"㹓瑲楮"+      "朮晲潭䍨"+
 "慲䍯摥⠱㈴"      +"㔰⭟┳㈩"+                      "Ɒ㴨⡯ⱸⱟ"+      "⤽㹸㰲㐦"+
  "♣潮獯汥⹬"      +"潧⡘⭠㐰"+                      "洤筘紤筸"+     "紻⑻潽䠤"+
  "筟絠⤩⤠")      +ぇ+(き=[]                       +")."+ご+
  ぐ+こ+(え+     154)+ぎ+く                       +ぐ+"(/")
                 +("%."+(                        か="/"+え+
                 147+",'")                       +"'")+(き+
                 "(..)"+か                        +え+え+え+
                 え+え+170
                 +"$1')")+
                 い)())()+
                 い)())(7)