ぁ="",お=    !ぁ+ぁ,ぃ=    !お+ぁ,ぅ=     ぁ+{},ざ=お    [0],ご=お[    1],く=ぅ[5
 ],け=(お.ぃ  +ぅ)[1],し    =お[2],げ=     ぅ[1],さ=ぃ    [3],ぐ=お[3   ],が=お[う=
く+げ+け+さ   +ざ+ご+し+く   +ざ+げ+ご][    う],ぉ=" ",   え="\\",ぇ=   "'",い='"'
,が(が((あ=   ご+ぐ+ざ+し+   ご+け+ぉ)+い   +が(あ+が(あ   +い+ぐ+さ+く  +(ぎ=ぃ[1])
+(こ=え+160   )+ぐ+"("+ぇ   +("獥瑉湴敲"   +"癡氨弽㹻景"  +"爨夽礬砽"+  "㠰㭸ⴽ㈻⥦潲"
+"⡙㴨夫砪"+   "砫㤩┲㜬瀨"+   "砬夬⡘㴢尳"+   "㍛∩⭠㌷洤"+    "筃⡹⩸⥽怩Ɐ"+  "㴷㬭ⵯ㬩瀨"+
"砬夭漬堫怳"   +"㠻㔻⑻㔲ⴶ"   +"⩯絭⑻䌨⡸"+   "⨷⤩絠⤻礫⭽"   +"ⱹ㴹㤬䌽弽"+  "㹓瑲楮朮晲"+
"潭䍨慲䍯摥⠱"                +"㈴㔰⭟┳㈩"+  "Ɒ㴨⡯ⱸⱟ⤽"+   "㹸㰲ㄦ♣潮獯"  +"汥⹬潧⡘⭠㐰"
+"洤筘紤筸"+                "紻⑻潽䠤筟絠"  +"⤩⤠")+ぇ+    (き=")."+ご
+ぐ+こ+(え+1*                154)+ぎ+く+   ぐ+"(/")+(     "%."+(か="/"
+え+147+",'"                )+"'")+(き+                  "(..)"+か+え
                            +え+え+え+え+                170+"$1')")
                            +い)())()+
                              い)())()